app/views/businesses/show.html.erb

		  <h3> Your Events: </h3>
		  <% if @business.deals.any? %>
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = 18 ORDER BY deals.created_at DESC LIMIT 1
SELECT COUNT(*) FROM "deals" WHERE "deals"."business_id" = 18