app/controllers/businesses_controller.rb

  def show
    @business = Business.find(params[:id])
		@deals = @business.deals.find(:all, conditions: {isEvent: false}).paginate(page: params[:deals_page], per_page: 5)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT 1  [["id", "18"]]
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = 18 ORDER BY deals.created_at DESC
SELECT COUNT(*) FROM "deals" WHERE "deals"."business_id" = 18

  def create
    @business = Business.new(params[:business])
    if @business.save
---
INSERT INTO "businesses" ("address", "created_at", "email", "fridayCloseTime", "fridayOpenTime", "imageOption", "imageURL", "imageUpload", "latitude", "longDescription", "longitude", "mondayCloseTime", "mondayOpenTime", "name", "password_digest", "phoneNumber", "remember_token", "saturdayCloseTime", "saturdayOpenTime", "shortDescription", "sundayCloseTime", "sundayOpenTime", "thursdayCloseTime", "thursdayOpenTime", "tuesayCloseTime", "tuesdayOpenTime", "updated_at", "websiteURL", "wednesdayCloseTime", "wednesdayOpenTime") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    unless params[:cancel].blank?
      redirect_to @business
      return
    end

    if params[:business][:password].blank?
      @business.update_attribute(:name, params[:business][:name])
---
UPDATE "businesses" SET "name" = 'The Axe & Palms', "remember_token" = 'qyqBJKW18nZCKW_j3YkNgg', "updated_at" = '2013-04-14 23:44:22.368605' WHERE "businesses"."id" = 18

  def index
    if current_business.admin?
      @businesses = Business.all
---
SELECT "businesses".* FROM "businesses"