app/controllers/deals_controller.rb

	def create
		@deal = current_business.deals.build(params[:deal])
    if @deal.save
---
INSERT INTO "deals" ("address", "business_id", "created_at", "endDate", "endTime", "firstTag", "friday", "imageOption", "imageURL", "imageUpload", "latitude", "longDescription", "longitude", "monday", "promotionOrEvent", "saturday", "secondTag", "shortDescription", "startDate", "startTime", "sunday", "thirdTag", "thursday", "title", "tuesday", "updated_at", "wednesday") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def show
		@deal = current_business.deals.find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = 18 AND "deals"."id" = ? ORDER BY deals.created_at DESC LIMIT 1  [["id", "1"]]

  def edit
    @deal = current_business.deals.find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = 18 AND "deals"."id" = ? ORDER BY deals.created_at DESC LIMIT 1  [["id", "1"]]

  def update
    unless params[:cancel].blank?
      redirect_to current_business
      return
    end
    @deal = current_business.deals.find(params[:id])
    if @deal.update_attributes(params[:deal])
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = 18 AND "deals"."id" = ? ORDER BY deals.created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "deals" SET "title" = '50% off milkshakes!!', "startDate" = '2013-04-14', "endDate" = '2013-04-20', "updated_at" = '2013-04-14 23:44:46.983704' WHERE "deals"."id" = 1