app/controllers/sessions_controller.rb

SELECT "businesses".* FROM "businesses" WHERE "businesses"."email" = 'themanagement@tap.org' LIMIT 1
---
  def create
		business = Business.find_by_email(params[:session][:email].downcase)